In this exercise, you will use the mls_salaries.csv dataset:

1. Load the data and examine the information using info, describe, and head.

In [1]:
import pandas as pd

In [3]:
mls = pd.read_csv("datasets/mls_salaries.csv")

In [4]:
mls.head()

  club last_name first_name position  base_salary  guaranteed_compensation
0  ATL   Almiron     Miguel        M    1912500.0               2297000.00
1  ATL   Ambrose      Mikey        D      65625.0                 65625.00
2  ATL      Asad      Yamil        M     150000.0                150000.00
3  ATL     Bloom       Mark        D      99225.0                106573.89
4  ATL  Carleton     Andrew        F      65000.0                 77400.00

In [5]:
mls.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 615 entries, 0 to 614
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   club                     614 non-null    object
 1   last_name                614 non-null    object
 2   first_name               610 non-null    object
 3   position                 604 non-null    object
 4   base_salary              614 non-null    float64
 5   guaranteed_compensation  614 non-null    float64
dtypes: float64(2), object(4)
memory usage: 29.0+ KB

In [8]:
masknan = mls.isna().any(axis=1)

In [9]:
mls[masknan]

,club,last_name,first_name,position,base_salary,guaranteed_compensation
9,ATL,Gressel,Julian,NaN,75000.0,93750.00
19,ATL,Oblitey Otoo,Jeffrey,NaN,53000.0,53000.00
46,CHI,Juninho,NaN,M,700008.0,716674.67
83,CLB,Steffen,Zack,NaN,105000.0,105000.00
109,COL,Saeid,Mohammed,NaN,160000.0,170000.00
116,DAL,Barrios,Michael,NaN,100000.0,100000.00
184,HOU,Hunter,Taylor,NaN,53004.0,53004.00
241,LA,Pedro,Joao,NaN,120000.0,141000.00
265,MNUFC,Ibson,NaN,M,200004.0,210337.40
321,NE,Nguyen,Lee,NaN,500000.0,500000.00
401,ORL,Kaka,NaN,M,6660000.0,7167500.00
429,PHI,Ilsinho,NaN,M,470000.0,518333.33
435,PHI,Medunjanin,Haris,NaN,460008.0,505008.00
553,SJ,Wynne,Marvell,NaN,245808.0,257058.00
613,NaN,NaN,NaN,NaN,NaN,NaN

In [14]:
mls.dropna(how="all", inplace=True)

2. Check the unique clubs and unique positions.

In [15]:
mls.club.unique()

array(['ATL', 'CHI', 'CLB', 'COL', 'DAL', 'DC', 'HOU', 'KC', 'LA', 'LAFC',
       'MNUFC', 'MTL', 'NE', 'NYCFC', 'NYRB', 'ORL', 'PHI', 'POR', 'RSL',
       'SEA', 'SJ', 'TOR', 'VAN'], dtype=object)

In [16]:
mls.position.unique()

array(['M', 'D', 'F', nan, 'GK', 'F-M', 'D-M', 'M-F', 'M-D', 'M/F', 'F/M'],
      dtype=object)

3. What is the average base salary for each club?

In [23]:
clubs = mls.groupby("club")

In [25]:
avg_base_sal = clubs["base_salary"].mean()

4. Which club has the highest average base salary?

In [30]:
avg_base_sal.max()

743516.5555555555

5. Which club has the highest base salary?

In [34]:
club_max_sal = clubs.base_salary.max()

In [44]:
club_max_sal.sort_values(ascending=False).iloc[0]

np.float64(6660000.0)

6. What is the average guaranteed compensation for each position?

In [46]:
positions = mls.groupby("position")

In [47]:
positions.guaranteed_compensation.mean()

position
D      178298.043187
D-M    154328.927857
F      562097.967685
F-M    367920.805000
F/M    131250.000000
GK     159503.673750
M      411300.879320
M-D    230282.250000
M-F    240999.248889
M/F    565000.000000
Name: guaranteed_compensation, dtype: float64

8. what is the median salary per club?
and what is the avarege median salary of all clubs? is it differant then the ("avarage") median salary in general? why?

In [49]:
clubs.base_salary.median()

club
ATL      125000.04
CHI      135000.00
CLB      117504.00
COL      109175.00
DAL      150000.00
DC       120000.00
HOU      156500.00
KC       127504.00
LA       105000.00
LAFC      59004.00
MNUFC    155000.00
MTL      100000.08
NE       140000.00
NYCFC    126778.52
NYRB     100004.00
ORL      132500.00
PHI      114999.96
POR      135000.00
RSL      134004.00
SEA      115000.00
SJ       150000.00
TOR      102850.00
VAN      123000.00
Name: base_salary, dtype: float64

In [50]:
clubs.base_salary.median().mean()

np.float64(123209.72173913044)

9.  Using get_group, display the players from the club with the fewest members.

In [52]:
clubs.size().idxmin()

'LAFC'